SNS.Apps.KPC.Libs.Services/Service References/InsuranceService_Metlife_Ref/YSW2ICareSave.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:intf="http://icare-uat.metlife.com.cn/services/YSW2ICareSave" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:impl="http://icare-uat.metlife.com.cn/services/YSW2ICareSave" targetNamespace="http://icare-uat.metlife.com.cn/services/YSW2ICareSave" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types />
  <wsdl:message name="doRequestResponse">
    <wsdl:part name="doRequestReturn" type="soapenc:string" />
  </wsdl:message>
  <wsdl:message name="doRequestRequest">
    <wsdl:part name="xmlInput" type="soapenc:string" />
  </wsdl:message>
  <wsdl:portType name="YSW2ICareSave">
    <wsdl:operation name="doRequest" parameterOrder="xmlInput">
      <wsdl:input name="doRequestRequest" message="impl:doRequestRequest" />
      <wsdl:output name="doRequestResponse" message="impl:doRequestResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="YSW2ICareSaveSoapBinding" type="impl:YSW2ICareSave">
    <wsdlsoap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="doRequest">
      <wsdlsoap:operation soapAction="" />
      <wsdl:input name="doRequestRequest">
        <wsdlsoap:body use="encoded" namespace="http://webservices.ec.sinosoft.com" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="doRequestResponse">
        <wsdlsoap:body use="encoded" namespace="http://icare-uat.metlife.com.cn/services/YSW2ICareSave" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="YSW2ICareSaveService">
    <wsdl:port name="YSW2ICareSave" binding="impl:YSW2ICareSaveSoapBinding">
      <wsdlsoap:address location="http://icare-uat.metlife.com.cn/services/YSW2ICareSave" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>