fourgad/src/main/resources/soapRecords2.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.ec.sinosoft.com">
   <soapenv:Header/>
   <soapenv:Body>
      <web:doRequest soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <xmlInput xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><![CDATA[<?xml version="1.0" encoding="GBK"?><Records><Record><Customer><Key>FromSystem000000000000000000001</Key><FromSystem>FromSystem</FromSystem><Name>test</Name><Sex>Male</Sex><Birthday>1974-11-15</Birthday><Document /><DocumentType>IdentityCard</DocumentType><Email /><Mobile>17876853030</Mobile><ContactState><Name>鍖椾含锟?#xfffd;</Name></ContactState><ContactCity><Name>鍖椾含锟?#xfffd;</Name></ContactCity><ContactAddress>鏄屽钩</ContactAddress><Occupation><Code>0001001</Code></Occupation><Description /></Customer><Task><CallList><Name /></CallList><Campaign><Name /></Campaign></Task><Activity><Code /><Present><Code /></Present><TSR><Code>805095</Code></TSR><DonateTime>2015-05-04</DonateTime><SMS>1</SMS><FlghtNo /><ValidTime /></Activity></Record></Records>]]></xmlInput>
      </web:doRequest>
   </soapenv:Body>
</soapenv:Envelope>